AirfoilBasic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


4
(
    side
    {
        type            empty;
        physicalType    patch;
        nFaces          82170;
        startFace       81755;
    }

    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          415;
        startFace       163925;
    }

    airfoil
    {
        type            wall;
        physicalType    patch;
        nFaces          217;
        startFace       164340;
    }

    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          198;
        startFace       164557;
    }

)


// ************************************************************************* //
