AirfoilBasic/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../0/variables/data"

forces {
  type            forces;
  libs            ("libforces.so");
  patches         (airfoil); 
  CofR            (0 0 0);
  rho             rhoInf;
  rhoInf          1.225;
}

forceCoeffs
{
    type            forceCoeffs;
    libs            ("libforces.so");
    patches         (airfoil);
    
    rho             rhoInf;
    rhoInf          1.225;
    
    // Lift, Drag, and Pitch directions
    liftDir         $myLiftDir;    // Adjust based on your Angle of Attack
    dragDir         $myDragDir;    // Direction of the flow
    pitchAxis       (0 0 1);
    
    magUInf         $v;           // Freestream velocity magnitude
    lRef            1;           // Reference length (Chord)
    Aref            0.1;         // Reference area (Span * Chord)
    CofR            (0 0 0);
}
// ************************************************************************* //
